/* 
*   用时 55min
*   得分 70
 */
/* 
*   用时 58min
*   得分 100
 */
#include <stdio.h>
#include <iostream>
#include <algorithm>
using namespace std;

const int T = 100005, S = 300005;
int t, s, a;
int cost;

//参考了https://blog.csdn.net/cax1165/article/details/90574849
//if-else判断的依据要减去交税了的部分
int main()
{
    scanf("%d", &t);
    if (t <= 3500)
    {
        s = t;
    }
    else
    {
        a = t - 3500;
        if (a <= (1500-45))
        {
            s = 3500 + a * 100 / 97;
        }else if(a <=(4500-45-300)){
            s = 3500+1500+(a-(1500-45))/90*100;
        }else if(a <= (9000-45-300-900)){
            s = 3500+4500+(a-(4500-45-300))/80*100;
        }
        else if(a <= (35000-45-300-900-6500)){
            s = 3500+9000+(a-(9000-45-300-900))/75*100;
        }
        else if(a <= (55000-45-300-900-6500-6000)){
            s = 3500+35000+(a-(35000-45-300-900-6500))/70*100;
        }
        else if(a <= (80000-45-300-900-6500-6000-8750)){
            s = 3500+55000+(a-(55000-45-300-900-6500-6000))/65*100;
        }
        else{
            s = 3500+80000+(a-(80000-45-300-900-6500-6000-8750))/55*100;
        }
    }
    printf("%d\n",s);
    return 0;
}